tap "homebrew/bundle"
tap "mac-cleanup/mac-cleanup-py"
tap "oven-sh/bun"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Python cleanup script for macOS
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# User-friendly GUI app for Homebrew
cask "applite"
# 3D creation suite
cask "blender"
# Translation application for text, pictures, and manual input
cask "bob"
# Screen capturing tool
cask "cleanshot"
# Collaborative team software
cask "figma"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Web browser
cask "microsoft-edge"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Messaging app with a focus on speed and security
cask "telegram"
# TinyPNG client
cask "tinypng4mac"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
mas "Bob", id: 1630034110
mas "Dropover", id: 1355679052
mas "Infuse", id: 1136220934
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Quantumult X", id: 1443988620
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.next-js"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "moalamri.inline-fold"
vscode "mrcrowl.easy-less"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "prisma.prisma"
vscode "redjue.git-commit-plugin"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.icons"
vscode "tauri-apps.tauri-vscode"
vscode "unbug.codelf"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "xyc.vscode-mdx-preview"
vscode "zhuangtongfa.material-theme"
